# RbsParallelpipesHorizontalNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelpipesHorizontalNumber Property
ParameterTypeId Class See Also
---
"Horizontal Number for parallel pipes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelpipesHorizontalNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelpipesHorizontalNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelpipesHorizontalNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace